# 7-1

In [1]:
import pandas as pd
import numpy as np

In [2]:
path = 'https://raw.githubusercontent.com/dongupak/BigDataAnalysis/main/'
df = pd.read_csv(path+'scores.csv', encoding='UTF-8', index_col=0)
df

         이름  국어   수학  과학
학번
251101  홍길동  90   90  60
251102  홍길순  85   90  80
251103  이철수  50   70  90
251104  김영희  80   60  70
251105  정선아  80   78  76
251106  이정민  80  100  90
251107  박동윤  70   75  80

# 7-2

In [6]:
pd_animals = pd.Series(['토끼','여우','곰','하마','사자'])
print(pd_animals)
pd_animals2 = pd.Series(['토끼','여우','곰','하마','사자'], index=list('abcde'))
print(pd_animals2)

0    토끼
1    여우
2     곰
3    하마
4    사자
dtype: object
a    토끼
b    여우
c     곰
d    하마
e    사자
dtype: object

# 7-3

In [12]:
id_series = pd.Series([251101, 251102, 251103, 251104])
name_series= pd.Series(['홍길동', '홍길순', '이철수', '김영희'])
kor_series = pd.Series([90, 85, 50, 801]) # 국어 점수
math_series = pd.Series([90, 90, 70, 601]) # 수학 점수
sci_series = pd.Series([60, 80, 90, 701]) # 과학 점수
eng_series = pd.Series([75, 80, 70, 601]) # 영어 점수

In [15]:
student_df = pd.DataFrame({'이름': name_series, '국어': kor_series, '수학': math_series, '과학': sci_series, '영어': eng_series}).set_index(id_series)
student_df

         이름   국어   수학   과학   영어
251101  홍길동   90   90   60   75
251102  홍길순   85   90   80   80
251103  이철수   50   70   90   70
251104  김영희  801  601  701  601

# 7-4

In [18]:
student_df.loc[251101]

이름    홍길동
국어     90
수학     90
과학     60
영어     75
Name: 251101, dtype: object

In [21]:
student_df.iloc[0]

이름    홍길동
국어     90
수학     90
과학     60
영어     75
Name: 251101, dtype: object

In [22]:
student_df.loc[251101:251103]

         이름  국어  수학  과학  영어
251101  홍길동  90  90  60  75
251102  홍길순  85  90  80  80
251103  이철수  50  70  90  70

In [23]:
student_df.iloc[0:3]

         이름  국어  수학  과학  영어
251101  홍길동  90  90  60  75
251102  홍길순  85  90  80  80
251103  이철수  50  70  90  70